/*

Имеются три сущности: Расчетный счет, валютный счет, кредит. Для каждой сущности нужен отдельный класс. Нужно подумать какие действия можно выделить в базовый класс, а какие могут использовать только определенный тип счета
Действия которые можно выполнить счет:
1) Узнать баланс
2) Снятие/вложение денег
3) Перевести в рубли
4) Узнать процент по кредиту
5) Истек ли срок счета
6) Узнать срок действия счета

*/

class basicAccount {
	constructor () {
		this.prefix = '\u20BD';
		
	}
}


//'\u0024'